Revit 2026 API

# IndependentTagGetLeaderElbow Method

---

Returns the position of the elbow of the tag's leader that points to specified reference. Position of leader's elbow.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetLeaderElbow(
	Reference referenceTagged
)
```
```vb
Public Function GetLeaderElbow (
	referenceTagged As Reference
) As XYZ
```
```cpp
public:
XYZ^ GetLeaderElbow(
	Reference^ referenceTagged
)
```
```fsharp
member GetLeaderElbow :
        referenceTagged : Reference -> XYZ
```

#### Parameters

referenceTagged Reference
     The reference which is tagged.

#### Return Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentException | The specified reference does not have a leader or its leader is straight. -or- The specified reference is not currently tagged. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The IndependentTag object does not have a tag behavior. |

Straight leaders do not have elbow points.

#### Reference

IndependentTag Class

Autodesk.Revit.DB Namespace